tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/services"
brew "async-profiler"
brew "awscli"
brew "bash"
brew "cmake"
brew "datadog-static-analyzer"
brew "diff-so-fancy"
brew "gh"
brew "gnupg"
brew "htop"
brew "hyperfine"
brew "jdtls"
brew "jq"
brew "libpq", link: true
brew "libsodium"
brew "mas"
brew "mkcert"
brew "node"
brew "openjdk@21"
brew "pinentry-mac"
brew "pkgconf"
brew "socat"
brew "tfenv"
brew "watch"
cask "bruno"
cask "copilot-cli"
cask "docker-desktop"
cask "figma-agent"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "keepingyouawake"
cask "macs-fan-control"
cask "pgadmin4"
cask "rectangle"
cask "sublime-text"
mas "Bitwarden", id: 1352778147
mas "Slack", id: 803453959
mas "Steam Link", id: 1246969117
mas "Windows App", id: 1295203466
