tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "ethereum/ethereum"

brew "mas"              # Mac App Store

#CLI tools
brew "bat"              # "cat" replacement
brew "htop"             # "top" replacement
brew "jq"               # JSON processor
brew "ncdu"             # "du" replacement
brew "exa"              # "ls" replacement
brew "fd"               # "find" replacement
brew "ripgrep"          # "grep replacement"
brew "grc"              # View logs with colour
brew "md5sha1sum"
brew "prettyping"
brew "socat"
brew "diff-so-fancy"

# Build tools
brew "maven"
brew "gradle"
brew "automake"
brew "cmake"

# Runtime envs
cask "homebrew/cask-versions/adoptopenjdk8"
brew "openjdk"
brew "openjdk@11"
brew "go"
brew "nodenv"       # Manage multiple NodeJS versions
brew "node"
brew "solidity"
#brew "solidity@5"

# Infra management
brew "terraform"
brew "ansible"

# Security & identity
brew "gnupg"
brew "pinentry-mac"

# Apps
cask "discord"
cask "vagrant"
cask "zoom"
cask "google-chrome"
cask "firefox"
cask "keepingyouawake"
cask "sublime-text"
cask "smcfancontrol"
cask "mactex"
cask "android-studio"
cask "flipper"
cask "rectangle"
cask "virtualbox"
cask "iterm2"
cask "intellij-idea"

mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835

brew "mkcert" # Simple tool to make locally trusted development certificates
brew "direnv" # Load/unload environment variables based on $PWD
brew "hyperfine" # Command-line benchmarking tool
cask "docker"
brew "gauge"
brew "folly"
brew "watchman"
#brew "launchdns", restart_service: true # Mini DNS server designed solely to route queries to localhost
